// !test commit for test jenkins
// TODO:project-root/
// │
// !├── src/
// ?│   ├── public/assets           // Ресурсы приложения (изображения, шрифты и т.д.)
// ?│   ├── styles/               // Стили приложения
// ?|   |__ pages/                // Router pages
// !│   ├── common/               // Общие компоненты, хуки, утилиты и типы данных
// │   │   ├── components/       // Общие компоненты
// │   │   ├── hooks/            // Общие хуки
// │   │   ├── utils/            // Общие утилиты
// │   │   ├── enums/            // Перечисления
// │   │   ├── types/            // Общие типы данных
// │   │   └── ...
// !│   ├── features/             // Функциональные модули
// │   │   ├── auth/             // Модуль аутентификации
// │   │   │   ├── api/          // Модуль API для аутентификации
// │   │   │   ├── lib/          // Дополнительные библиотеки или утилиты для аутентификации
// │   │   │   ├── useLogin.ts   // Хук для логина
// │   │   │   ├── model/        // Модели данных
// │   │   │   ├── __tests__/    // Тесты для модуля аутентификации
// │   │   │   └── ui/           // Компоненты пользовательского интерфейса для аутентификации
// │   │   └── ...
// │   └── ...
// ├──//? package.json              // Файл с зависимостями и скриптами
// └──//TODO: README.md             // Документация проекта
